esden/stm32cube-database/db/mcu/memory/STM32_DIE495_256_1024.xml
<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<rzone xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="0.2.0" xs:noNamespaceSchemaLocation="AMC_rzone.xsd">

  <device Dname="STM32WB-1M" Dvendor="STMicroelectronics:13" info="ARM Cortex-M4, 256 KB RAM, 1 MB FLASH">
    <package info="STMicroelectronics STM32WB Series Device Support" name="STM32WBxx_DFP" url="http://www.st.com/" vendor="STMicroelectronics" version="0.0.1-dev1"/>
    <processor Dclock="64000000" Dcore="ARM Cortex-M4" DcoreVersion="r0_p1" Ddsp="DSP" Dendian="Little-endian" DnumInterrupts="83"/>
  </device>

  <resources>

    <memories>
      <memory access="rx" info="Flash memory" name="Flash" size="0x00100000" start="0x08000000" type="ROM"/>

      <memory access="rwx" info="SRAM2 Code" name="SRAM2_C" physical="0x20030000" size="0x00010000" start="0x10000000" type="RAM"/>

      <memory access="rwx" info="SRAM1" name="SRAM1" size="0x00030000" start="0x20000000" type="RAM"/>
      <memory access="rwx" info="SRAM2" name="SRAM2" size="0x00010000" start="0x20030000" type="RAM"/>

      <memory external="true" info="QSPI" name="QSPI" size="0x10000000" start="0x90000000"/>
    </memories>

   </resources>

</rzone>
